#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.data: Refreshing state... [id=820379311794-acme-dev-data]
aws_security_group.drift-sg: Refreshing state... [id=sg-01f4149316da129a6]
aws_security_group.bad-sg: Refreshing state... [id=sg-039e652d4faa07ffc]
data.aws_caller_identity.current: Reading...
aws_security_group.web-node: Refreshing state... [id=sg-00bfe535acfb899a0]
aws_ecs_task_definition.service: Refreshing state... [id=service]
data.aws_caller_identity.current: Read complete after 0s [id=820379311794]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket.data will be destroyed
  # (because aws_s3_bucket.data is not in configuration)
  - resource "aws_s3_bucket" "data" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::820379311794-acme-dev-data" -> null
      - bucket                      = "820379311794-acme-dev-data" -> null
      - bucket_domain_name          = "820379311794-acme-dev-data.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "820379311794-acme-dev-data.s3.ap-southeast-2.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z1WCIGYICN2BYD" -> null
      - id                          = "820379311794-acme-dev-data" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-southeast-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "820379311794-acme-dev"
          - "Name"        = "820379311794-acme-dev-data"
          - "customer"    = "Customer-Name-Here"
          - "git_org"     = "davesc63"
          - "git_repo"    = "Prisma-Cloud-IaC-Demo"
          - "yor_trace"   = "78cbb9e3-ce7e-42bb-a573-12d7db25ff96"
        } -> null
      - tags_all                    = {
          - "Environment" = "820379311794-acme-dev"
          - "Name"        = "820379311794-acme-dev-data"
          - "customer"    = "Customer-Name-Here"
          - "git_org"     = "davesc63"
          - "git_repo"    = "Prisma-Cloud-IaC-Demo"
          - "yor_trace"   = "78cbb9e3-ce7e-42bb-a573-12d7db25ff96"
        } -> null

      - grant {
          - id          = "d59ae24b85f49360bf0f4669ee56027bba50bb67324d990b8cd3d441bf243d50" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.perthdemo will be created
  + resource "aws_s3_bucket" "perthdemo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "820379311794-acme-dev-perth-demo"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-perth-demo"
          + "customer"    = "Perth-IaC-Demo"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "yor_trace"   = ""
        }
      + tags_all                    = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-perth-demo"
          + "customer"    = "Perth-IaC-Demo"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "yor_trace"   = (known after apply)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_public_access_block.perthdemo will be created
  + resource "aws_s3_bucket_public_access_block" "perthdemo" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @davesc63, Action: `pull_request`*